# coding=utf-8
"""
Author: Austin
Created: 2016-11-17
Version: 1.0
"""
from QycxbWebEsConvert import convert

if __name__ == '__main__':
    test_source = u'''
    {
    "分支机构":[
        "宁波金田新材料有限公司江北分公司",
        "宁波金田新材料有限公司工会委员会"
    ],
    "变更信息":[
        {
            "变更后":"（注：标有*标志的为法定代表人）许可经营项目:无",
            "变更前":"（注：标有*标志的为法定代表人）许可经营项目:",
            "时间":"2009-12-09",
            "变更项目":"许可经营项目变更"
        },
        {
            "变更后":"（注：标有*标志的为法定代表人）住所:慈溪经济开发区（杭州湾新区）滨海四路636号;邮政编码:315336;电话:87574121;住所所在行政区划:崇寿镇收起更多",
            "变更前":"（注：标有*标志的为法定代表人）住所:慈溪经济开发区（杭州湾新区）九塘南路邻里中心1号楼102室;邮政编码:315336;电话:87574121;住所所在行政区划:崇寿镇收起更多",
            "时间":"2009-12-09",
            "变更项目":"住所(营业场所、地址)变更"
        },
        {
            "变更后":"（注：标有*标志的为法定代表人）企业名称:宁波金田铜业（集团）股份有限公司;出资额:7200;百分比:100%;法人性质:企业法人收起更多",
            "变更前":"（注：标有*标志的为法定代表人）企业名称:宁波金田铜业（集团）股份有限公司;出资额:7000;百分比:100%;法人性质:企业法人收起更多",
            "时间":"2010-09-08",
            "变更项目":"投资人(股权)变更"
        },
        {
            "变更后":"（注：标有*标志的为法定代表人）7200",
            "变更前":"（注：标有*标志的为法定代表人）7000",
            "时间":"2010-09-08",
            "变更项目":"注册资本(金)变更"
        },
        {
            "变更后":"（注：标有*标志的为法定代表人）7200",
            "变更前":"（注：标有*标志的为法定代表人）7000",
            "时间":"2010-09-08",
            "变更项目":"实收资本变更"
        }
    ],
    "机构信息":{
        "所属地区":"宁波市",
        "机构类型":"企业法人",
        "机构名称":"宁波金田新材料有限公司",
        "机构地址":"浙江省宁波市慈溪经济开发区(杭州湾新区)滨海四路636号",
        "机构代码":"668459014",
        "证书有效期":"2007-11-01 至 2017-10-31",
        "登记证号":"330218000001197",
        "登记机关":"浙江省宁波市质量技术监督局"
    },
    "主体信息":{
        "注册资本":"7,200.0000(万元人民币)",
        "法人代码":"668459014",
        "企业法人":"郑敦敦",
        "经营期限":"2007-11-01 至 2017-10-31",
        "注册号":"330218000001197",
        "登记日期":"2007-11-01",
        "经营状态":"正常",
        "企业地址":"浙江省宁波市慈溪经济开发区(杭州湾新区)滨海四路636号",
        "经营范围":"许可经营项目无一般经营项目新型建筑材料、纳米材料研究、开发；电子漆包线、电线、电缆、电工器材制造、加工、销售；自营和代理货物和技术的进出口，但国家限定经营或禁止进出口的货物和技术除外。",
        "主体类型":"一人有限责任公司（私营法人独资）"
    },
    "股东信息":[
        {
            "企业法人":"宁波金田铜业（集团）股份有限公司",
            "详情":[
                "认缴：0",
                "实缴：0"
            ]
        }
    ]
}

    '''
    result = convert(test_source)
    assert result is not None and len(result) != 0
