# encoding=utf-8
# test
import json
from CzzxWebEsConvert import  convert

if __name__ == '__main__':
    test_source = u'''
{
    "主要人员":{
        "监事":"蒋淑芳",
        "执行董事兼总经理":"王陆良"
    },
    "工商信息":{
        "法定代表人：":"王陆良",
        "企业地址：":"湖州市埭溪镇山背村新路头1号",
        "经营状态：":"存续",
        "成立日期：":"2011年07月21日",
        "登记机关：":"湖州市吴兴区工商行政管理局",
        "营业期限：":"至永久",
        "注册号：":"330503000053675",
        "经营范围：":"一般经营项目：水稻、蔬菜的种植。",
        "公司类型：":"私营有限责任公司(自然人控股或私营性质企业控股)",
        "注册资本：":"100万元美元",
        "发照日期：":"2015年07月30日"
    },
    "分支机构":[

    ],
    "主干信息":[
        "地址:湖州市埭溪镇山背村新路头1号  ",
        "最后更新日期：2016-03-28"
    ],
    "变更人员":[
        {
            "变更项目：":"行业代码变更",
            "变更后：":"行业代码:0111",
            "变更日期：":"2014-02-25",
            "变更前：":"行业代码:0141"
        },
        {
            "变更项目：":"一般经营项目变更",
            "变更后：":"一般经营项目: 水稻、蔬菜的种植。",
            "变更日期：":"2014-02-25",
            "变更前：":"一般经营项目: 生态农业开发；蔬菜、水果的种植；淡水鱼、虾的养殖。"
        },
        {
            "变更项目：":"投资人(股权)变更",
            "变更后：":"",
            "变更日期：":"2013-09-17",
            "变更前：":"姓名: 林久剑; 出资额: 26; 百分比: 26% 姓名: 王陆良; 出资额: 74; 百分比: 74%"
        },
        {
            "变更项目：":"组织机构变更",
            "变更后：":"",
            "变更日期：":"2013-09-17",
            "变更前：":"姓名: 林久剑; 证件名称: ; 证件号码: ********; 性别: 男性; 职务: 监事 姓名: 王陆良; 证件名称: ; 证件号码: ********; 性别: 男性; 职务: 执行董事兼总经理或经理"
        },
        {
            "变更项目：":"投资人(股权)变更",
            "变更后：":"",
            "变更日期：":"2013-08-16",
            "变更前：":"姓名: 林久剑; 出资额: 26; 百分比: 26% 姓名: 王陆良; 出资额: 37; 百分比: 37% 姓名: 郑新春; 出资额: 37; 百分比: 37%"
        }
    ],
    "股东信息":[
        {
            "认缴出资(金额/时间):":"  ",
            "实缴出资(金额/时间)：":"  ",
            "股东类型：":"自然人",
            "股东：":""
        },
        {
            "认缴出资(金额/时间):":"  ",
            "实缴出资(金额/时间)：":"  ",
            "股东类型：":"自然人",
            "股东：":""
        }
    ]
}

    '''
    result = convert(test_source)

    print json.dumps(result)
    assert result[u'RegistrationInfo']['RegistAuthority'] == u'湖州市吴兴区工商行政管理局'

    assert len(result['MainMember']) == 2

    assert result['BranchOrg'] is None

    assert len(result['ShareholderInfo']) == 2
