# coding=utf-8
import json

from Gs_Web_EsConvert import convert


def test_convert():
    test_source_gsgs = u'''
    {
    "经营异常信息":{
        "经营异常信息":[

        ]
    },
    "电子营业执照":null,
    "行政处罚信息":{
        "行政处罚信息":[

        ]
    },
    "抽查检查信息":{
        "抽查检查信息":[

        ]
    },
    "股权出质登记信息":{
        "股权出质登记信息":[

        ]
    },
    "备案信息":{
        "主要人员信息":[
            {
                "序号":"1",
                "姓名":"吴昊",
                "职务":"监事"
            },
            {
                "序号":"2",
                "姓名":"吴建江",
                "职务":"执行董事"
            }
        ],
        "分支机构信息":[
            {
                "序号":"1",
                "登记机关":"浦东新区市场监管局 ",
                "注册号/统一社会信用代码":"913101155574448135 ",
                "名称":"上海朱仕实业有限公司浦东第一分公司"
            }
        ],
        "清算信息":null
    },
    "享受扶持信息":null,
    "登记信息":{
        "撤销信息":[

        ],
        "变更信息":[
            {
                "变更事项":"投资人(股权)变更",
                "变更日期":"2015年6月25日",
                "变更后内容":"吴建江;吴昊;",
                "变更前内容":"朱顺伯;朱道;"
            },
            {
                "变更事项":"法定代表人变更",
                "变更日期":"2015年6月25日",
                "变更后内容":"吴建江",
                "变更前内容":"朱顺伯"
            },
            {
                "变更事项":"监事备案",
                "变更日期":"2015年6月25日",
                "变更后内容":"吴昊",
                "变更前内容":"朱道"
            },
            {
                "变更事项":"注册资本(金)变更",
                "变更日期":"2015年6月25日",
                "变更后内容":"1500.000000万人民币",
                "变更前内容":"1500.000000万人民币"
            }
        ],
        "基本信息":{
            "注册资本":"1500.000000万人民币",
            "经营期限自":"2005年11月1日",
            "成立日期":"2005年11月1日",
            "注册号/":"9131011578240544X8",
            "住所":"浦东新区祝桥镇金闻路28号 ",
            "名称":"上海朱仕实业有限公司",
            "核准日期":"2005年11月1日",
            "经营范围":"塑料制品（除特种设备）、五金件、弹簧、汽车零配件、五金冲件的制造、加工、销售，普通机械、化工原料及产品（除危险化学品、监控化学品、烟花爆竹、民用爆炸物品、易制毒化学品）、金属制品、塑料制品、五金交电、机电产品的销售，从事货物及技术的进出口业务。 【依法须经批准的项目，经相关部门批准后方可开展经营活动】",
            "类型":"有限责任公司",
            "经营期限至":"2025年10月31日",
            "登记状态":"存续（在营、开业、在册）",
            "法定代表人":"吴建江",
            "登记机关":"浦东新区市场监管局"
        },
        "股东信息":[
            {
                "详情":" ",
                "证照/证件号码":" ",
                "证照/证件类型":" 中华人民共和国居民身份证 ",
                "股东类型":"自然人股东",
                "股东":"吴昊"
            },
            {
                "详情":" ",
                "证照/证件号码":" ",
                "证照/证件类型":" 中华人民共和国居民身份证 ",
                "股东类型":"自然人股东",
                "股东":"吴建江"
            }
        ]
    },
    "严重违法信息":{
        "严重违法信息":[

        ]
    },
    "动产抵押登记信息":{
        "动产抵押登记信息":[

        ]
    }
}
    '''
    test_source_qygs = u'''
        {
    "简易注销信息":{
        "简易注销信息":[

        ]
    },
    "行政处罚信息":{
        "行政处罚信息":[

        ]
    },
    "股权变更信息":{
        "股权变更信息":[

        ]
    },
    "股东及出资信息":{
        "股东及出资信息（币种与注册资本一致）":[
            {
                "认缴明细":{
                    "认缴出资日期":"2008年3月17日",
                    "认缴出资方式":"货币",
                    "认缴出资额（万元）":"1050.000000"
                },
                "认缴额（万元）":"1050.000000",
                "股东":"朱道",
                "实缴明细":{
                    "实缴出资日期":null,
                    "实缴出资额（万元）":null,
                    "实缴出资方式":null
                },
                "实缴额（万元）":null
            },
            {
                "认缴明细":{
                    "认缴出资日期":"2008年3月17日",
                    "认缴出资方式":"货币",
                    "认缴出资额（万元）":"450.000000"
                },
                "认缴额（万元）":"450.000000",
                "股东":"朱顺伯",
                "实缴明细":{
                    "实缴出资日期":null,
                    "实缴出资额（万元）":null,
                    "实缴出资方式":null
                },
                "实缴额（万元）":null
            }
        ],
        "变更信息":[

        ]
    },
    "知识产权出质登记信息":{
        "知识产权出质登记信息":[

        ]
    },
    "企业年报":{
        "企业年报":[
            {
                "序号":"1",
                "报送年度":" ",
                "发布日期":"2016年2月24日"
            },
            {
                "序号":"2",
                "报送年度":" ",
                "发布日期":"2015年3月11日"
            },
            {
                "序号":"3",
                "报送年度":" ",
                "发布日期":"2014年10月24日"
            }
        ]
    },
    "行政许可信息":{
        "行政许可信息":[

        ]
    }
}
    '''
    json.loads(test_source_qygs)
    result = convert(test_source_gsgs, test_source_qygs)
    assert result is not None


if __name__ == '__main__':
    test_convert()
