# coding=utf-8

from XiZhiWebEsConvert import convert


def test_convert():
    test_source = u'''
    {
    "知识产权":"0",
    "对外投资":"0",
    "企业名片":null,
    "风险信息":"18",
    "企业年报":"2",
    "基本信息":{
        "分支机构":[

        ],
        "主要成员":[
            {
                "董事":"王作旭"
            },
            {
                "董事长":"李纪彬"
            },
            {
                "董事":"张秀君"
            },
            {
                "总经理":"李纪彬"
            },
            {
                "监事":"毕重新"
            }
        ],
        "工商基本信息":{
            "注册资本":"300 万人民币",
            "址":null,
            "公司类型":"有限责任公司(自然人投资或控股)",
            "经营范围":"工程建设监理（甲级）、工程技术咨询＊＊＊",
            "注册号":"210200000175744",
            "经营日期":"1999-09-15",
            "经营状态":"存续（在营、开业、在册）",
            "发照日期":"1999-09-15",
            "统一社会信用代码":null,
            "组织机构代码":null,
            "营业期限":"1999-09-15 — 2019-09-14",
            "企业地址":"辽宁省大连市甘井子区汇善南园21-3号",
            "法定代表人":"李纪彬",
            "登记机关":"大连市工商行政管理局"
        },
        "股东信息":[
            {
                "认缴出资（金额 / 时间）":"60 万",
                "股东":"企业法人",
                "实缴出资（金额 / 时间）":"60 万",
                "股东信息":"大化集团有限责任公司"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"于进平"
            },
            {
                "认缴出资（金额 / 时间）":"2.4 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"2.4 万",
                "股东信息":"郝秦生"
            },
            {
                "认缴出资（金额 / 时间）":"26.386 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"26.386 万",
                "股东信息":"张秀君"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"徐枫"
            },
            {
                "认缴出资（金额 / 时间）":"121.11 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"121.11 万",
                "股东信息":"李纪彬"
            },
            {
                "认缴出资（金额 / 时间）":"4.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"4.168 万",
                "股东信息":"侯志忠"
            },
            {
                "认缴出资（金额 / 时间）":"15.96 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"15.96 万",
                "股东信息":"侯新学"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"刘文惠"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"寇祖文"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"李爱国"
            },
            {
                "认缴出资（金额 / 时间）":"2.336 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"2.336 万",
                "股东信息":"曲范柱"
            },
            {
                "认缴出资（金额 / 时间）":"16.148 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"16.148 万",
                "股东信息":"丁立滨"
            },
            {
                "认缴出资（金额 / 时间）":"3.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"3.168 万",
                "股东信息":"刘彦斌"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"王文卿"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"王继华"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"李怀东"
            },
            {
                "认缴出资（金额 / 时间）":"17.95 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"17.95 万",
                "股东信息":"陈忠远"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"李升运"
            },
            {
                "认缴出资（金额 / 时间）":"2.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"2.168 万",
                "股东信息":"邵国勇"
            },
            {
                "认缴出资（金额 / 时间）":"1.168 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"1.168 万",
                "股东信息":"王树昌"
            },
            {
                "认缴出资（金额 / 时间）":"16.531 万",
                "股东":"非农民自然人",
                "实缴出资（金额 / 时间）":"16.531 万",
                "股东信息":"俞飞鸿"
            }
        ]
    }
}
    '''
    result = convert(test_source)

    assert result[u'RegistrationInfo']['RegistAuthority'] == u'大连市工商行政管理局'

    assert len(result['MainMember']) == 5

    assert result['BranchOrg'] is None

    assert len(result['ShareholderInfo']) > 10


if __name__ == "__main__":
    test_convert()
